{
  "file": "corner_kick_strategy.json",
  "title": "Corner Kick Strategy",
  "meta": {
    "difficulty_elo": 1500,
    "lesson_id": "gen_1768860742"
  },
  "content": {
    "title": "Corner Kick Strategy: Set-Piece Mastery",
    "intro_hook": "A well-planned corner kick is a golden opportunity to score; it's a set-piece that can turn the tide of a match.",
    "core_concept": {
      "explanation": "In football, 'strategy' refers to a plan of action designed to achieve a goal. For a corner kick, this involves specific player positions, runs, and the type of delivery. We use the imperative mood for instructions ('Go near post!', 'Mark number 9!') and modal verbs like 'should' and 'could' to discuss tactical possibilities ('We should play it short', 'He could make a late run').",
      "analogy": "A corner kick strategy is like a rehearsed play in American football. The taker is the quarterback, the runners in the box are the receivers running specific routes, and the goal is the end zone. Everyone must know their role for the 'play' to work."
    },
    "vocabulary_rich": [
      {
        "term": "Near Post",
        "meaning": "The goalpost closest to the corner taker. A common target for whipped-in crosses."
      },
      {
        "term": "Far Post",
        "meaning": "The goalpost furthest from the corner taker. Often targeted for lofted crosses for taller players."
      },
      {
        "term": "In-swinging",
        "meaning": "A cross that curves towards the goal from a corner, making it dangerous for goalkeepers."
      },
      {
        "term": "Out-swinging",
        "meaning": "A cross that curves away from the goal from a corner, often aimed for a player attacking the ball."
      },
      {
        "term": "Short Corner",
        "meaning": "A tactical option where the corner is passed short to a nearby teammate to create a different crossing angle."
      },
      {
        "term": "Zonal Marking",
        "meaning": "A defensive strategy where players guard an area of the penalty box rather than a specific opponent."
      },
      {
        "term": "Man-to-Man Marking",
        "meaning": "A defensive strategy where each defender is responsible for marking a specific attacking player."
      }
    ]
  },
  "interactive_engine": {
    "scenario_text": "It's the 89th minute, and your team is awarded a corner kick while drawing 1-1. You have two tall centre-backs in the box. The opposition is defending with zonal marking. As the captain, you shout instructions to the corner taker.",
    "options": [
      {
        "text": "Shout: 'Play it short to the edge of the box for a shot!'",
        "outcome": "WRONG",
        "feedback": "While a surprise tactic, this is low percentage when you have aerial advantage and need a decisive goal. It wastes your key strength."
      },
      {
        "text": "Shout: 'Whip an in-swinging cross to the near post! One of you attack it!'",
        "outcome": "CORRECT",
        "feedback": "Perfect. An in-swinging cross to the near post is dangerous against a zonal defence and plays to your players' strength in the air. It forces the goalkeeper to make a difficult decision."
      },
      {
        "text": "Shout: 'Lift it to the far post for a knockdown!'",
        "outcome": "WRONG",
        "feedback": "A far-post cross is a valid option, but 'lifting' it gives defenders and the goalkeeper more time to react. A whipped, driven cross is generally more effective in this late-game scenario."
      }
    ]
  }
}