{
  "file": "the_counter_attack.json",
  "title": "The Counter Attack",
  "meta": {
    "difficulty_elo": 1500,
    "lesson_id": "gen_1768860650"
  },
  "content": {
    "title": "The Counter Attack",
    "intro_hook": "Turn your opponent's greatest strength into their most dangerous moment.",
    "core_concept": {
      "explanation": "A 'counter attack' is a fast, direct attack launched immediately after regaining possession of the ball from the opponent. It is a noun phrase. In football, it is a strategic transition from defense to attack. In English, we use the preposition 'on' to describe it, e.g., 'They scored on the counter-attack.' or 'They are dangerous on the counter.'",
      "analogy": "A counter attack is like a perfect, one-touch passing move. The opponent's attack is their pass into your half. Your team's interception is the first touch, controlling the situation. The lightning-fast sprint forward and clinical finish is the decisive return pass into the back of the net."
    },
    "vocabulary_rich": [
      {
        "term": "To soak up pressure",
        "meaning": "To defend resiliently against sustained opposition attack, inviting them forward."
      },
      {
        "term": "To spring the counter",
        "meaning": "To initiate the fast break, often with a quick pass or dribble out of defense."
      },
      {
        "term": "To break at pace",
        "meaning": "To attack with high speed and few players, exploiting the space left by the opponent."
      },
      {
        "term": "A transition",
        "meaning": "The moment a team switches from defense to attack, or attack to defense."
      },
      {
        "term": "To be caught on the break",
        "meaning": "To be defensively vulnerable because your team was committed to attacking."
      }
    ]
  },
  "interactive_engine": {
    "scenario_text": "Your team, defending a 1-0 lead, wins the ball in your own penalty area. The opposition has pushed nearly all their players forward for a corner. Your centre-back has the ball at his feet with two opposition strikers nearby. You have two pacey wingers already looking to sprint up the pitch. What is the best immediate instruction?",
    "options": [
      {
        "text": "Shout 'Time! Hold it!' to keep possession and slow the game down.",
        "outcome": "WRONG",
        "feedback": "This wastes the moment of surprise and allows the opponent to recover their defensive shape. The counter-attacking opportunity is lost."
      },
      {
        "text": "Shout 'Out wide! Release it early!' to play a first-time long pass to a winger in space.",
        "outcome": "CORRECT",
        "feedback": "Perfect. This exploits the huge space behind the opponent's advanced defenders. A quick, direct pass 'releases' your fast players to launch the counter-attack at speed."
      },
      {
        "text": "Instruct the centre-back to dribble forward and draw a foul to win a free-kick.",
        "outcome": "WRONG",
        "feedback": "This is high-risk. Dribbling in your own area under pressure could lead to losing possession in a very dangerous position, conceding a goal."
      }
    ]
  }
}