{
  "meta": {
    "difficulty_elo": 1400,
    "lesson_id": "gen_1768507876"
  },
  "content": {
    "title": "The VAR Review",
    "intro_hook": "When the referee needs a second opinion, VAR steps in to make the right call!",
    "core_concept": {
      "explanation": "VAR stands for Video Assistant Referee, a system used in football to review decisions made by the main referee. It helps ensure fairness by checking key incidents like goals, penalties, red cards, and mistaken identity. The process involves a team of officials watching video replays from multiple angles and communicating with the referee on the pitch.",
      "analogy": "Think of VAR as the referee's instant replay coach. Just like a coach reviews game footage to improve strategy, VAR reviews match footage to correct crucial decisions, ensuring the game is played fairly and accurately."
    },
    "vocabulary_rich": [
      {
        "term": "VAR",
        "meaning": "Video Assistant Referee; a technology system that assists referees by reviewing video footage of key incidents during a match."
      },
      {
        "term": "Offside",
        "meaning": "A rule where a player is in an illegal position ahead of the ball and the second-last opponent when the ball is played to them."
      },
      {
        "term": "Penalty",
        "meaning": "A free kick taken from the penalty spot, awarded for a foul committed inside the penalty area."
      },
      {
        "term": "Red Card",
        "meaning": "A card shown by the referee to a player who commits a serious offense, resulting in their immediate dismissal from the match."
      },
      {
        "term": "Mistaken Identity",
        "meaning": "When the referee incorrectly identifies and penalizes the wrong player for an offense."
      }
    ]
  },
  "interactive_engine": {
    "scenario_text": "In a tense Premier League match, Manchester United is attacking against Liverpool. Marcus Rashford receives a through pass and scores, but the assistant referee raises the flag for offside. The referee on the pitch is unsure and decides to use VAR to review the decision. As the VAR team checks the footage, they need to determine if Rashford was offside when the ball was played.",
    "options": [
      {
        "text": "The VAR team should immediately confirm the offside because the assistant referee raised the flag.",
        "outcome": "WRONG",
        "feedback": "VAR reviews the footage independently to check if the assistant referee's decision was correct, not just to confirm it. They use video evidence to make an accurate call."
      },
      {
        "text": "The VAR team analyzes the video from multiple angles to see if any part of Rashford's body that can legally score was ahead of the second-last defender when the ball was passed.",
        "outcome": "CORRECT",
        "feedback": "Correct! VAR checks the offside by examining the exact moment the ball was played and the positions of the players. If Rashford was offside, the goal is disallowed; if not, it stands. This ensures fairness based on clear evidence."
      },
      {
        "text": "The VAR team ignores the offside check and focuses on whether there was a foul during the build-up.",
        "outcome": "WRONG",
        "feedback": "VAR reviews specific incidents like offside when the referee requests it. In this scenario, the offside call is the key issue being reviewed, so they must check it first."
      }
    ]
  }
}