{
  "file": "yellow_card_vs_red_card.json",
  "title": "Yellow Card vs Red Card",
  "meta": {
    "difficulty_elo": 1500,
    "lesson_id": "gen_1768860674"
  },
  "content": {
    "title": "Yellow Card vs Red Card: The Language of Discipline",
    "intro_hook": "Understand the rules of the game, and you'll understand the drama.",
    "core_concept": {
      "explanation": "In English football, 'yellow card' and 'red card' are specific terms for disciplinary actions. A 'yellow card' is a formal warning for a serious foul or unsporting behaviour. A 'red card' is a dismissal from the game, usually for a very dangerous foul, violent conduct, or receiving a second yellow card. The key grammar is using the articles 'a' or 'the' with these terms (e.g., 'He got a yellow card', 'The red card was deserved').",
      "analogy": "Think of it like a traffic light system. A yellow card is a 'caution' light – slow down and be careful. A red card is a 'stop' light – your game is over."
    },
    "vocabulary_rich": [
      {
        "term": "To be booked",
        "meaning": "To receive a yellow card from the referee."
      },
      {
        "term": "To be sent off",
        "meaning": "To be shown a red card and ordered to leave the pitch."
      },
      {
        "term": "Dismissal",
        "meaning": "The act of sending a player off with a red card."
      },
      {
        "term": "Caution",
        "meaning": "Another word for a yellow card warning."
      },
      {
        "term": "Second yellow",
        "meaning": "A second yellow card offence, which automatically becomes a red card."
      }
    ]
  },
  "interactive_engine": {
    "scenario_text": "In a tense derby match, a defender commits a late, sliding tackle from behind, stopping a clear attacking opportunity. The referee blows his whistle and reaches into his pocket...",
    "options": [
      {
        "text": "The referee shows a red card immediately.",
        "outcome": "WRONG",
        "feedback": "While it's a serious foul, a professional foul that denies a clear goal-scoring opportunity is usually a red card. However, if the tackle was reckless but not excessively forceful, a yellow card might be given. The scenario says it's a 'late, sliding tackle from behind', which is often a straight red."
      },
      {
        "text": "The referee shows a yellow card.",
        "outcome": "CORRECT",
        "feedback": "Good thinking! This is a classic 'professional foul' to stop an attack. While it can be a red, it is very commonly punished with a yellow card, especially if the referee judges the tackle as reckless rather than using excessive force. The key language point: 'He was shown a yellow card for the foul.'"
      },
      {
        "text": "The referee gives a verbal warning but no card.",
        "outcome": "WRONG",
        "feedback": "This type of foul, which stops a promising attack, is almost always punished with at least a yellow card. A simple warning would be very unusual and incorrect according to the Laws of the Game."
      }
    ]
  }
}